КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ИзменениеАссортимента/ИзменениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="088ef687-1ea4-4570-b52a-31cf8dad179d">
  <name>ИзменениеАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7bb19dd0-56f9-4ba1-80a9-85fd57403a35">
    <name>Стадия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9363caca-cef9-4437-8432-4fa44ff10a88">
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="bad7dc37-a78f-4a01-a0c8-c7573c8f71d3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6e8b383-1a7b-4037-b337-3fb424b25167">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f94cdc50-538c-40f6-a601-aa79fd49ae55">
      <name>РольАссортимента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ЭтапыИзмененияАссортимента/ЭтапыИзмененияАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2f35f70b-f695-47b5-907b-3b6f88a80bc2">
  <name>ЭтапыИзмененияАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="00ccca3d-008a-4259-b525-1a9ffc8346e1">
    <name>ВводВАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4c1c00db-b1db-46dd-ad76-67a936cf4e37">
    <name>ВводВАссортиментСОтсрочкойНачалаПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0cbadffb-3264-4e65-a60e-808afd04979b">
    <name>ИзменениеСостоянияАссортимента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9809f95b-2d6d-4c85-8c1c-85dcb9cc326d">
    <name>ВыводИзАссортимента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="43013b47-f194-4afa-88a7-10cbbb453b77">
    <name>ПереносВАрхивОтзыв</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/РолиАссортимента/РолиАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="49bd7895-0477-4e6d-9237-25c4a2944fc1">
  <name>РолиАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c977ea13-d958-44ab-9208-1112c53fc2db">
    <name>ПостоянныйАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cc180ee-4c2d-4019-9a57-6fd5b89704f7">
    <name>ДополнительныйАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cbca0cc1-eed4-462f-88ed-bc51075a8823">
    <name>ПробныйАссортимент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ИзменениеАссортимента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОД_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для каждого Т Из ТекущийОбъект.Товары Цикл
			
			Если ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда

				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Основной ассортимент", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Под заказ", Истина));
				КонецЕсли;
				
			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж Тогда
				
				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Основной ассортимент", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Под заказ", Истина));
				КонецЕсли;

			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
				
				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Основной ассортимент", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Под заказ", Истина));
				КонецЕсли;
				
			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента Тогда
				
				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Выводится из ассортимента", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив", Истина));
				КонецЕсли;

			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв Тогда
				УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив", Истина));
			КонецЕсли;;
		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДополнительныйРеквизит(п_Номенклатура, п_Значение)

	ЗначенияДополнительныхРеквизитов = Новый ТаблицаЗначений;
	ЗначенияДополнительныхРеквизитов.Колонки.Добавить("Свойство");
	ЗначенияДополнительныхРеквизитов.Колонки.Добавить("Значение");
	
    НоваяСтрока = ЗначенияДополнительныхРеквизитов.Добавить();
    НоваяСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Ассортимент", Истина);
    НоваяСтрока.Значение = п_Значение;
	
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(п_Номенклатура, ЗначенияДополнительныхРеквизитов);

КонецПроцедуры
